[
"You’re that “Nothing” when people ask me what I’m thinking about.",
"You look great today.",
"You’re a smart cookie.",
"I bet you make babies smile.",
"You have impeccable manners.",
"I like your style.",
"You have the best laugh.",
"I appreciate you.",
"You are the most perfect you there is.",
"Our system of inside jokes is so advanced that only you and I get it. And I like that.",
"You’re strong.",
"Your perspective is refreshing.",
"You’re an awesome friend.",
"You light up the room.",
"You deserve a hug right now.",
"You should be proud of yourself.",
"You’re more helpful than you realize.",
"You have a great sense of humor.",
"You’ve got all the right moves!",
"Is that your picture next to “charming” in the dictionary?",
"Your kindness is a balm to all who encounter it.",
"You’re all that and a super-size bag of chips.",
"On a scale from 1 to 10, you’re an 11.",
"You are brave.",
"You’re even more beautiful on the inside than you are on the outside.",
"You have the courage of your convictions.",
"Aside from food. You’re my favorite.",
"If cartoon bluebirds were real, a bunch of them would be sitting on your shoulders singing right now.",
"You are making a difference.",
"You’re like sunshine on a rainy day.",
"You bring out the best in other people.",
"Your ability to recall random factoids at just the right time is impressive.",
"You’re a great listener.",
"How is it that you always look great, even in sweatpants?",
"Everything would be better if more people were like you!",
"I bet you sweat glitter.",
"You were cool way before hipsters were cool.",
"That color is perfect on you.",
"Hanging out with you is always a blast.",
"You always know — and say — exactly what I need to hear when I need to hear it.",
"You smell really good.",
"You may dance like no one’s watching, but everyone’s watching because you’re an amazing dancer!",
"Being around you makes everything better!",
"When you say, “I meant to do that,” I totally believe you.",
"When you’re not afraid to be yourself is when you’re most incredible.",
"Colors seem brighter when you’re around.",
"You’re more fun than a ball pit filled with candy. (And seriously, what could be more fun than that?)",
"That thing you don’t like about yourself is what makes you so interesting.",
"You’re wonderful.",
"Everyday is just BLAH when I don’t see you For reals! (awesome – you are halfway through the list. You’re awesome!)",
"Jokes are funnier when you tell them.",
"You’re better than a triple-scoop ice cream cone. With sprinkles.",
"Your bellybutton is kind of adorable.",
"Your hair looks stunning.",
"You’re one of a kind!",
"You’re inspiring.",
"If you were a box of crayons, you’d be the giant name-brand one with the built-in sharpener.",
"You should be thanked more often. So thank you!!",
"Our community is better because you’re in it.",
"Someone is getting through something hard right now because you’ve got their back.",
"You have the best ideas.",
"You always know how to find that silver lining.",
"Everyone gets knocked down sometimes, but you always get back up and keep going.",
"You’re a candle in the darkness.",
"You’re a great example to others.",
"Being around you is like being on a happy little vacation.",
"You always know just what to say.",
"You’re always learning new things and trying to better yourself, which is awesome.",
"If someone based an Internet meme on you, it would have impeccable grammar.",
"You could survive a Zombie apocalypse.",
"You’re more fun than bubble wrap.",
"When you make a mistake, you fix it.",
"Who raised you? They deserve a medal for a job well done.",
"You’re great at figuring stuff out.",
"Your voice is magnificent.",
"The people you love are lucky to have you in their lives.",
"You’re like a breath of fresh air.",
"You’re gorgeous — and that’s the least interesting thing about you, too.",
"You’re so thoughtful.",
"Your creative potential seems limitless.",
"You’re the coolest person I know. And I consider myself bet friends with like all celebrities, so. . . .",
"You’re irresistible when you blush.",
"Actions speak louder than words, and yours tell an incredible story.",
"Somehow you make time stop and fly at the same time.",
"When you make up your mind about something, nothing stands in your way.",
"You seem to really know who you are.",
"Any team would be lucky to have you on it.",
"In high school I bet you were voted “most likely to keep being awesome.”",
"I bet you do the crossword puzzle in ink.",
"Babies and small animals probably love you.",
"If you were a scented candle they’d call it Perfectly Imperfect (and it would smell like summer).",
"There’s ordinary, and then there’s you.",
"You’re someone’s reason to smile.",
"You’re even better than a unicorn, because you’re real.",
"How do you keep being so funny and making everyone laugh?",
"You have a good head on your shoulders.",
"Has anyone ever told you that you have great posture?",
"The way you treasure your loved ones is incredible.",
"You’re really something special.",
"You’re a gift to those around you.",
"Your positivity is infectious.  ",
"You should be so proud of yourself. ",
"You’re amazing! ",
"You’re a true gift to the people in your life. ",
"You’re an incredible friend. ",
"I really appreciate everything that you do. ",
"You inspire me to be a better person. ",
"Your passion always motivates me. ",
"Your smile makes me smile. ",
"Thank you for being such a great person. ",
"The way you carry yourself is truly admirable. ",
"You are such a good listener. ",
"You have a remarkable sense of humor. ",
"Thanks for being you! ",
"You set a great example for everyone around you. ",
"I love your perspective on life. ",
"Being around you makes everything better. ",
"You always know the right thing to say. ",
"The world would be a better place if more people were like you! ",
"You are one of a kind. ",
"You make me want to be the best version of myself. ",
"You always have the best ideas. ",
"I’m so lucky to have you in my life. ",
"Your capacity for generosity knows no bounds. ",
"I wish I were more like you. ",
"You are so strong. ",
"I’ve never met someone as kind as you are. ",
"You have such a great heart. ",
"Simply knowing you has made me a better person. ",
"You are beautiful inside and out. ",
"You are so special to everyone you know. ",
"Your mere presence is reassuring to me. ",
"Your heart must be 10 times the average size. ",
"You are my favorite person to talk to. ",
"You’ve accomplished so many incredible things. ",
"I appreciate your friendship more than you can know. ",
"I love how you never compromise on being yourself. ",
"I tell other friends how wonderful you are. ",
"You helped me realize my own worth. ",
"Your point of view is so refreshing. ",
"You always make me feel welcome. ",
"You deserve everything you’ve achieved. ",
"I am so proud of your progress. ",
"I’m lucky just to know you. ",
"You are so down to earth. ",
"You know just how to make my day! ",
"You spark so much joy in my life. ",
"Your potential is limitless. ",
"You have a good head on your shoulders. ",
"You are making a real difference in the world. ",
"You’re so unique. ",
"You are wise beyond your years. ",
"You’re worthy of all the good things that come to you. ",
"Your parents must be so proud. ",
"How did you learn to be so great?  ",
"Never stop being you! ",
"No one makes me laugh harder than you do. ",
"You inspire me in so many different ways. ",
"You continue to impress me. ",
"You make the small things count. ",
"You’re a constant reminder that people can be good. ",
"I admire the way that you challenge me. ",
"You make me see things in an entirely new way. ",
"Thanks for always being there for me. ",
"You are a ray of sunshine. ",
"You have the courage of your convictions. ",
"On a scale of one to ten, you’re an eleven. ",
"You’re incredibly thoughtful. ",
"You have the best ideas. ",
"You’re the most perfect ‘you’ there is. ",
"You are the epitome of a good person. ",
"You always know how to find the silver lining. ",
"You’re the person that everyone wants on their team. ",
"I always learn so much when I’m around you. ",
"Is there anything you can’t do!? ",
"I wish I knew more people like you, you really have the ability to make people around you happy.",
"You are such a joy to be around because you always make me laugh and look at things from a different perspective.",
"You always make my day better when I am feeling down.",
"You make everyone feel so welcome, I don't think you have ever met a stranger.",
"You are so easy to be around and you always have something interesting to talk about.",
"Your confidence is refreshing, and there is no question as to why you are so self-assured.",
"You have such charisma that is clearly inspiring to the people with whom you interact.",
"You are a loyal friend and I know I can come to you with any issues that I have without facing any judgment.",
"It is always refreshing to be around you because of your authenticity and dedication to your values.",
"Your positive attitude and healthy lifestyle are an inspiration.",
"You bring out the best in people and show people how to live with courage.",
"I strive to be as outgoing as you are and display the amount of independence that you do every day.",
"You can always find the right words to say, even when everything is going wrong.",
"People who meet you instantly respect you because of your ability to be authoritative yet gentle, and self-confident yet modest.",
"You carry yourself with a lot of maturity during times where others revert to youthful behavior.",
"Your presence commands attention and respect, no matter how large the crowd is.",
"You are always so interesting to talk to. Your ideas and perceptions of things are unlike anything that would occur to me on my own.",
"You set the right example for those coming after you and it is clear to see that you take responsibility for your position of a role model.",
"You are so helpful to those who are in need, even when you feel like you have very little to offer.",
"I admire your patience and ability to remain calm during times of distress.",
"I appreciate how much you show you care about other people.",
"You always lift my mood with your positive energy and willingness to look for the silver lining in situations that are less than ideal.",
"You have a heart of gold that benefits so many people in your life.",
"Your thoughts and ideas are so creative, which has allowed you to refine your talent into something unique from others.",
"You can accomplish anything that you put your mind to.",
"I admire your abilities.",
"Everything you do is with excellence.",
"You are such a talented leader whom many want to follow and emulate.",
"You are a muse for me and so many others.",
"Other people, including myself, aspire to be like you one day.",
"All of your practice really shows in your work.",
"Your expertise in your craft resonates with me, and I want to learn from you.",
"Your years of hard work are truly paying off.",
"You do everything so effortlessly.",
"Your dedication to your craft is inspiring.",
"You are incomparable to other people with similar goals. You blow the competition out of the water.",
"You should be proud of yourself for refining your craft as much as you have. It is truly inspirational.",
"You may dance like no one's watching, but everyone's watching because you're an amazing person",
"You have the best new ideas that make your specific craft a step above your competition.",
"You are the most incredible when you're not afraid to be yourself.",
"You're more amazing than you will ever realize.",
"You are one of a kind and it continues to impress me.",
"You know that we are friends, but I want you to know that I’m also a huge fan of your work.",
"You are unbelievable. I can’t wait to see what you will be coming up with this time next year.",
"The confidence that you have in your craft if motivating,",
"You were born a natural.",
"You set a great example for people who want to be as successful as you.",
"Your work is inspiring both to those who have come before you and to people who will be following in your footsteps.",
"You are astoundingly gorgeous when you wake up in the morning.",
"Your eyes are so warm and welcoming.",
"You look like you spend all of your time in the gym",
"You're not wearing any makeup? Wow, you are flawless.",
"You light up a room when you walk in, and people definitely notice.",
"Your hairstyle frames your face perfectly.",
"Your face brightens up when you laugh and it spreads joy to those around you.",
"Your style is impeccable.",
"That color is perfect on you.",
"You make that outfit look amazing, not many people could pull that off like you do",
"You have a spring in your step today that is brightening up my day.",
"You look very happy and your energy is contagious.",
"You weren’t kidding when you said you were hitting the gym",
"I always get lost in your eyes.",
"Your inside is even more beautiful than your outside.",
"You exude confidence which really makes you beautiful.",
"You are radiant.",
"There’s a beautiful softness behind your eyes.",
"Has anyone ever told you that you have outstanding posture?",
"You are glowing.",
"You always make ordinary things look great.",
"Your smile is infectious.",
"You have a good head on your shoulders and you never forget to use it.",
"Your intelligence and curiosity inspire me.",
"Your brain works in incredible ways.",
"I always learn so many interesting and thought-provoking things from you.",
"You seem to really know who you are.",
"I truly respect and value your thoughts and ideas.",
"You always come up with the best solutions in a short amount of time.",
"Your way of thinking is so much different from other people's, and it is refreshing.",
"I can’t get over how wise you are — your wisdom in everything amazes me.",
"You seem to figure things out right away without struggling to find the right answer.",
"I could not have come up with the answer without you.",
"I feel like you know something about everything.",
"You always provide valuable insight into other people.",
"You have a knack for kindly challenging people's opinions with another point of view.",
"You are so resourceful.",
"I like being on a team with someone who is as perceptive as you.",
"People find your innovative thinking so inspiring.",
"You are such a great teacher.",
"I wish I could figure things out as quickly and accurately as you do.",
"Your company is so lucky to have you as an employee. I'm sure they value you far more than you realize.",
"You have a lot of knowledge to offer other people.",
"I appreciate your ability to see both the big picture and the small details.",
"When you are given a complex problem, you have the rare ability to find a simple solution.",
"I know I will learn a lot from you, both personally and professionally.",
"Your capabilities seem endless.",
"You are a really good problem-solver.",
"Your intelligence motivates others to learn.",
"That was a tough problem to solve. I like how you experimented with a few approaches before settling on one.",
"You are the most reflective learner I know.",
"You should share that idea with the boss. He would appreciate learning from you.",
"I wouldn’t have thought of that approach. You are great at thinking outside of the box.",
"I always turn to you when I'm unsure about something and you always have great insight or advice to help me through.",
"Your understanding and philosophical pursuit of the bigger picture is fascinating.",
"You’re my constant reminder of how just how clever some people can be.",
"I am proud of how far you have come in your journey.",
"Look at how much your time and dedication paid off.",
"You should be so proud that you have achieved something that very few people are ever able to do.",
"You worked really hard on that and it certainly was worth the time and energy in the end.",
"You impress me every single day with your ability to go the extra mile.",
"How did you learn to be so good? I've never seen someone make something look so easy.",
"Your parents must be so proud that you have come this far. They did an amazing job of instilling the power of hard work in you.",
"You're accomplishing so much. Every day you evolve into a better person than who you were the day before.",
"When you have a goal, you allow nothing to stand in your way. Your dedication and ability to see things through to the end is inspiring.",
"I hope to be where you are in five years.",
"Your commitment to your work has really paid off. Your achievements are commendable.",
"Congratulations, very few people are able to do what you have done, especially with such ease and poise.",
"You’re an expert at what you do, and people trust you because of it. I’m so impressed.",
"There should be a monument of you considering everything that you have accomplished.",
"When you make up your mind about something, nothing stands in your way. I admire your ability to see obstacles as learning experiences",
"You never cease to amaze me. Every time I think you have done it all, you do something else outstanding."
]